$(document).ready(function(){


    var v1 = "تعتبر منطقة مكة المكرمة أكثر مناطق المملكة من حيث الكثافة السكانية، ويبلغ إجمالي عدد سكان منطقة مكة المكرمة (8,803,545) نسمة، منهم (4,596,414) نسمة من المواطنين السعوديين، و(4,207,131) نسمة من المقيمين غير السعوديين، بحسب البيانات الصادرة من الهيئة العامة للإحصاء لعام (2018)م.";
    var v2 = `إمارة منطقة مكة المكرمة أنشئت عام 1344هـ أثناء توحيد المملكة العربية السعودية وتتبع الإمارة لوزارة الداخلية السعودية ومقرها الآن هو مكة المكرمة
           <br/>
            الأمير خالد بن فيصل بن عبد العزيز آل سعود أمير منطقة مكة المكرمة (المرة الثانية)
            <br/>
            الأمير بدر بن سلطان بن عبد العزيز آل سعود نائب أمير منطقة مكة المكرمة`;

    var v3 = `تمثيل خادم الحرمين الشريفين في المنطقة
    <br/>
    التأكد من تحقيق سير العدالة في المنطقة
    <br/>
    العمل على حفظ الأمن في المنطقة
    <br/>
    العمل على توفير كافة الخدمات لمواطني المنطقة بالتعاون والتنسيق مع الجهات الحكومية والمشاركة في مراحل التخطيط لكافة الخدمات 
    <br/>
    التأكد من كفاءة وفاعلية الخدمات التي تقدم لمواطني المنطقة، والعمل على تحسين وتطوير تقديم تلك الخدمات 
    <br/>
    تلقي شكاوي واستدعاءات المواطنين والنظر في أمورهم والعمل على تلبية مطالبهم وحل مشكلاتهم`;

    var v4 = `الشريف خالد بن لؤي 
    <br/>
    الملك فيصل بن عبد العزيز آل سعود
    <br/>
    الأمير متعب بن عبد العزيز آل سعود
    <br/>
    الأمير عبد الله بن سعود بن عبد العزيز آل سعود
    <br/>
    الأمير مشعل بن عبد العزيز آل سعود
    <br/>
    الأمير فواز بن عبد العزيز آل سعود
    <br/>
    الأمير ماجد بن عبد العزيز آل سعود
    <br/>
    الأمير عبد المجيد بن عبد العزيز آل سعود
    <br/>
    الأمير مقرن بن عبد العزيز آل سعود نائبا للحج إبان مرض الأمير عبد المجيد بن عبد العزيز
    <br/>
    الأمير خالد بن فيصل بن عبد العزيز آل سعود
    <br/>
    الأمير مشعل بن عبد الله بن عبد العزيز آل سعود
    <br/>
    الأمير خالد بن فيصل بن عبد العزيز آل سعود (للمرة الثانية)`;

    var v5 = `تتألف المنطقة من ستة عشر محافظة وهي:
    <br/>
    محافظة العاصمة المقدسة
    <br/>
    محافظة جدة
    <br/>
    محافظة الطائف
    <br/>
    محافظة رابغ
    <br/>
    محافظة الكامل
    <br/>
    محافظة القنفذة
    <br/>
    محافظة تربة
    <br/>
    محافظة الليث
    <br/>
    محافظة الجموم
    <br/>
    محافظة خليص
    <br/>
    محافظة أضم
    <br/>
    محافظة الخرمة
    <br/>
    محافظة رنية
    <br/>
    محافظة العرضيات
    <br/>
    محافظة الموية
    <br/>
    محافظة ميسان
    <br/>
    محافظة بحرة`;

    document.getElementById("title").innerText = "السكان";
    document.getElementById("content").innerHTML = v1;

    
    $(".list li").click( function(e){

       $(this).addClass("active").siblings().removeClass("active");
       var id = $(this).attr("id");

       if(id == 1){
         document.getElementById("title").innerText = "السكان";
         document.getElementById("content").innerHTML = v1;

       }else if(id == 2){
        document.getElementById("title").innerText = "إمارة المنطقة";

        document.getElementById("content").innerHTML = v2;

       }else if(id == 3){
        document.getElementById("title").innerText = "مهام الإمارة";

        document.getElementById("content").innerHTML = v3;

       }else if(id == 4){
        document.getElementById("title").innerText = "أمراء مكة المكرمة منذ تأسيس المملكة";

        document.getElementById("content").innerHTML = v4;

       }else if(id == 5){
        document.getElementById("title").innerText = "المحافظات";

        document.getElementById("content").innerHTML = v5;

       }



    })
});